descent/stm32f4_prog/spi_sdcard/spi_sdcard.c
  /* Configure the System clock source, PLL Multiplier and Divider factors, 
     AHB/APBx prescalers and Flash settings ----------------------------------*/
  SetSysClock();

  /* Configure the Vector Table location add offset address ------------------*/
#ifdef VECT_TAB_SRAM
  SCB->VTOR = SRAM_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal SRAM */
#else
  SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal FLASH */
#endif
}


u8 spi1_rw_byte(u8 tx_b)
{
  while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET)
  {
  }
  SPI_I2S_SendData(SPI1, tx_b);
  while(SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET)
  {
  }
  return SPI_I2S_ReceiveData(SPI1);
}

void delay(uint32_t delay )
{
  while(delay) delay--;
}

void init_SPI1(void)
{
	
	GPIO_InitTypeDef GPIO_InitStruct;
	SPI_InitTypeDef SPI_InitStruct;
	
	// enable clock for used IO pins
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	
	/* configure pins used by SPI1
	 * PA5 = SCK
	 * PA6 = MISO
	 * PA7 = MOSI
	 */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7 | GPIO_Pin_6 | GPIO_Pin_5;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	// connect SPI1 pins to SPI alternate function
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource5, GPIO_AF_SPI1);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_SPI1);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource7, GPIO_AF_SPI1);
	
	// enable clock for used IO pins
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE, ENABLE);
	
	/* Configure the chip select pin
	   in this case we will use PA4 */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_4;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	GPIOA->BSRRL |= GPIO_Pin_4; // set PA4 high
#if 0
	/* Configure the chip select pin
	   in this case we will use PE7 */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_7;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOE, &GPIO_InitStruct);
	
	GPIOE->BSRRL |= GPIO_Pin_7; // set PE7 high
#endif	
	// enable peripheral clock
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE);
	
	/* configure SPI1 in Mode 0 
	 * CPOL = 0 --> clock is low when idle
	 * CPHA = 0 --> data is sampled at the first edge
	 */
	SPI_InitStruct.SPI_Direction = SPI_Direction_2Lines_FullDuplex; // set to full duplex mode, seperate MOSI and MISO lines
	SPI_InitStruct.SPI_Mode = SPI_Mode_Master;     // transmit in master mode, NSS pin has to be always high
	SPI_InitStruct.SPI_DataSize = SPI_DataSize_8b; // one packet of data is 8 bits wide
	SPI_InitStruct.SPI_CPOL = SPI_CPOL_Low;        // clock is low when idle
	SPI_InitStruct.SPI_CPHA = SPI_CPHA_1Edge;      // data sampled at first edge
	SPI_InitStruct.SPI_NSS = SPI_NSS_Soft | SPI_NSSInternalSoft_Set; // set the NSS management to internal and pull internal NSS high
	SPI_InitStruct.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_256; // SPI frequency is APB2 frequency / 4
	SPI_InitStruct.SPI_FirstBit = SPI_FirstBit_MSB;// data is transmitted MSB first
	SPI_Init(SPI1, &SPI_InitStruct); 
	
	SPI_Cmd(SPI1, ENABLE); // enable SPI1
}



uint8_t SPI1_send(uint8_t data)
{
  SPI1->DR = data; // write data to be transmitted to the SPI data register
  while( !(SPI1->SR & SPI_I2S_FLAG_TXE) ); // wait until transmit complete
  while( !(SPI1->SR & SPI_I2S_FLAG_RXNE) ); // wait until receive complete
  while( SPI1->SR & SPI_I2S_FLAG_BSY ); // wait until SPI is not busy anymore
  return SPI1->DR; // return received data from SPI data register
}

uint8_t xchg_spi (uint8_t dat)
{
  return SPI1_send(dat);
}

/**
 * @brief  Main program.
 * @param  None
 * @retval None
 */
int main(void)
{

#ifdef SET_CPU_CLOCK
  SystemInit();
#endif
  uint8_t received_val = 0;
  init_usart(115200);
  ur_puts(USART2, "Init complete! Hello World!\r\n");

  ur_puts(USART2, "Init sd\r\n");
  while(SD_Initialize())//檢測不到SD卡
  {
    delay(0x3fffff);
    ur_puts(USART2, "Init sd again\r\n");
  }

  ur_puts(USART2, "Init sd ok\r\n");

  static u8 cid[16];
  u8 ret = SD_GetCID(cid);
  if (ret == 0)
  {
    ur_puts(USART2, "get cid ok\r\n");
  }
  else
  {
    ur_puts(USART2, "get cid fail\r\n");
  }

#if 1
  for (int i=0 ; i < 16 ; ++i)
  {
    char str[20]="";
    s32_itoa(cid[i], str, 16);
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");
  }
#endif
  char pnm[10]="";
  pnm[0] = cid[1];
  pnm[1] = cid[2];
  pnm[2] = 0;
    ur_puts(USART2, "oid: ");
    ur_puts(USART2, pnm);
    ur_puts(USART2, "\r\n");
  pnm[0] = cid[3];
  pnm[1] = cid[4];
  pnm[2] = cid[5];
  pnm[3] = cid[6];
  pnm[4] = cid[7];
  pnm[5] = 0;
    ur_puts(USART2, "pnm: ");
    ur_puts(USART2, pnm);
    ur_puts(USART2, "\r\n");

  ret = SD_GetCSD(cid);
  if (ret == 0)
  {
    ur_puts(USART2, "get csd ok\r\n");
  }
  else
  {
    ur_puts(USART2, "get csd fail\r\n");
  }

  u8 byte,data,multi,blk_len;
  u32 c_size;
  u32 capacity=0;

		blk_len = 0x0F & cid[6]; // this should equal 9 -> 512 bytes
		/*	; get size into reg 
			;	  7				8			9
			; xxxx xxxx    xxxx xxxx    xxxx xxxx
			;        ^^    ^^^^ ^^^^    ^^ 
		*/
		data =(cid[7] & 0x03)<<6;
		data |= (cid[8] >> 2);
		c_size = data << 4;
		data =(cid[8] << 2 ) | ((cid[9] & 0xC0)>>6 );
		c_size |= data;
		
		/*	; get multiplier
			;	10			11
			; xxxx xxxx    xxxx xxxx
			;        ^^    ^
		*/
		multi = ((cid[10] & 0x03 ) << 1 ) ;
		multi |= ((cid[11] & 0x80) >> 7);
		// sectors = (size+1)<<(multiplier+2)
		capacity = (c_size + 1)<<(multi + blk_len + 2);

  char str[20]="";
  s32_itoa(capacity, str, 16);
    ur_puts(USART2, "hex:\r\n");
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");

  s32_itoa(capacity, str, 10);
    ur_puts(USART2, "dec:\r\n");
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");
#if 0
  for (int i=0 ; i < 16 ; ++i)
  {
    char str[20]="";
    s32_itoa(cid[i], str, 16);
    ur_puts(USART2, str);
    ur_puts(USART2, "\r\n");
  }
#endif

  while(1);
#if 0
  while(1)
  {
    //GPIOE->BSRRH |= GPIO_Pin_7; // set PE7 (CS) low
    GPIOA->BSRRH |= GPIO_Pin_4; // set PE7 (CS) low
    #if 1
    SPI1_send(0xAA);  // transmit data
    received_val = SPI1_send(0x12); // transmit dummy byte and receive data
    #endif
    //GPIOE->BSRRL |= GPIO_Pin_7; // set PE7 (CS) high
    GPIOA->BSRRL |= GPIO_Pin_4; // set PE7 (CS) high
  }
#endif

}

